{"rating": 5.0, "title": "Love it!", "text": "This is perfect for small places. I first saw it on YouTube and thought it couldn't be that good but it is. I hate going to the laundromat and waste so much money to do a couple loads. Now I can do laundry whenever I want. It's quit and efficient.  The little dryer doesn't use heat but pressure to get most of the water out your clothes, then it only takes like maybe a day or even less for everything to dry. I put it in my bathtub on top of a box so the bottom won't get wet.", "images": [], "asin": "B01ALBMIEI", "parent_asin": "B01ALBMIEI", "user_id": "AHXX5OD6QOUKMPY6VGU7SJ7LYCDQ", "timestamp": 1634827412541, "helpful_vote": 0, "verified_purchase": true}
{"rating": 4.0, "title": "Pretty Good Despite Some Small Complaints.", "text": "I received this washer today and ran it for the first time as soon as I unpacked it. It does what it's supposed to do. The agitation is powerful, surprisingly powerful. The spin dryer does an amazing job and is pretty quiet once the spinner gets going. I was not about to haul this thing atop some makeshift platform in order to make the gravity drain work, and I certainly wasn't going to carry pots of drain water to dump into the sink - I simply kept the drain hose in an upright position attaching it to the provided clip on the side of the washer and then slipped a smaller hose down inside the main drain hose - the other end of the smaller hose is attached to a small little pump I bought at my local home improvement store and drains into the kitchen sink. To drain the water I simply switched the washer to the 'Drain' setting and flipped the switch on the pump. Easy as pie. I did the same when running the spin dryer.<br />I do have a couple of complaints....<br />1. The washer arrived very, very dirty, especially the bottom - there was gross brown crud all over the bottom.<br />2. There was a number scratches and deep gouges on the outside.<br />3. The provided hose to fill is worthless - I simply attached a small hose used for normal full sized washing machines to my kitchen sink spigot and filled the washer that way - super easy and fast.<br /><br />It definitely cannot handle adult sized bedding, and I have my doubts that it can handle even one pair of jeans - not because of power, because it's pretty powerful, but I say this due to it's size - it's crazy small inside. But it's great for very small loads....a couple of shirts, with some socks, undies, etc..", "images": [], "asin": "B01ALBMIEI", "parent_asin": "B01ALBMIEI", "user_id": "AHQUSMRY7LHRNOXURSWYC7N7WH7Q", "timestamp": 1464146981000, "helpful_vote": 3, "verified_purchase": true}
{"rating": 5.0, "title": "Small , some noise but not too loud.", "text": "Like , like , like  .Easy to use for washing and is fast, clean very good.", "images": [], "asin": "B01ALBMIEI", "parent_asin": "B01ALBMIEI", "user_id": "AEROHL3NDZJOVQS4EISJ7KZENFFA", "timestamp": 1565410537843, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "... a year and I have to say I am amazed with it", "text": "I've had this product now for almost a year and I have to say I am amazed with it. It cleans my clothes better than anything. I use an oxy laundry detergent but just a dab because you don't want anything too sudsy. I usually use cold to temperate water unless it's socks and undies then I let them wash, sit for 5 mins and wash again. Sparkling white. The washing cycle agitates wonderfully and the spin cycle almost completely dries the clothes. They're barely damp. I turn on my fan and they are dry in a half an hour. I have to put the machine up on a small table that's about the same height as my bathtub because there's no pump to get the water out of the machine, it drains via gravity. I thought about buying a small pool pump but for now it's fine. I've saved 30 dollars a week not going to the laundromat anymore and it's convenient and easy to use. I let it dry after I'm done (keeping the lids open) and I spray it with lysol because I don't want mold to grow on it. Also, keep the lint filter clean after every wash before you rinse so you don't get the fuzz on the clothes in the rinse cycle.  I use my long hose hand held shower head to fill it but it has leads for a small hose. My sink would work but it doesn't come apart to attach a hose. I've never had a leak with this item and I did buy a warranty just in case. But so far all is great!!!!! I've recommended this to other people as well.", "images": [], "asin": "B01ALBMIEI", "parent_asin": "B01ALBMIEI", "user_id": "AEE5NWP5FL55C4YOPKP2CX3SNQNQ", "timestamp": 1495917933000, "helpful_vote": 4, "verified_purchase": true}
{"rating": 4.0, "title": "Perfect for an RV when a laundromat isn't available", "text": "I've seen some YouTube reviews on this and similar items. I live in an RV full time without a laundromat near by. So I purchased this to wash my clothes.<br /><br />The washer is a little noisy but if I shut my bathroom door, I don't hear it as much. When I first got it the back wasn't properly snapped into place but that was easily fixed.  The hose provided to fill the washer is useless, I just put my shower head into the tub.<br /><br />When I use this, I put about a tablespoon to 1.5 tablespoons of liquid laundry detergent for a large load with about half a scoop of oxi clean. I run my machine for 15 mins and then let it sit. I will drain the dirty water and rinse the tub a little bit. Then close the drain and fill with clean water and run for 15 more minutes. Then I will drain again. Pull half if the clothes and spin them for at max 4 mins. After the spin, they are damp but quickly dry.<br /><br />There are water levels for low, middle, and high water marks on the lint filter but they are hard to see. The lint filter is a nice way to catch loose thread but it doesn't filter all of the water.<br /><br />I store it behind my entertainment center and it fits really well there. The issue is getting into my bathroom. I have to go up a small set of stairs to the bathroom and it's a little bulky to easily get up there.  Because it has legs, I can have it in my shower when it's draining and not have to worry about the motor getting wet.<br /><br />Overall, it's a nice machine. I can put 2 pairs of jeans and several shirts in a load. I have even fit my entire queen sized sheet set including pillow cases into it.", "images": [{"small_image_url": "https://images-na.ssl-images-amazon.com/images/I/71RRBMNTWYL._SL256_.jpg", "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/71RRBMNTWYL._SL800_.jpg", "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/71RRBMNTWYL.jpg", "attachment_type": "IMAGE"}, {"small_image_url": "https://images-na.ssl-images-amazon.com/images/I/71o7v7zg7+L._SL256_.jpg", "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/71o7v7zg7+L._SL800_.jpg", "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/71o7v7zg7+L.jpg", "attachment_type": "IMAGE"}, {"small_image_url": "https://images-na.ssl-images-amazon.com/images/I/71vp3xBoY0L._SL256_.jpg", "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/71vp3xBoY0L._SL800_.jpg", "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/71vp3xBoY0L.jpg", "attachment_type": "IMAGE"}, {"small_image_url": "https://images-na.ssl-images-amazon.com/images/I/81CD7QuVrkL._SL256_.jpg", "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/81CD7QuVrkL._SL800_.jpg", "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/81CD7QuVrkL.jpg", "attachment_type": "IMAGE"}], "asin": "B01ALBMIEI", "parent_asin": "B01ALBMIEI", "user_id": "AH64MPSSSHNXQ6EGO7M5ZBYATDFA", "timestamp": 1597450774399, "helpful_vote": 0, "verified_purchase": true}
{"rating": 4.0, "title": "Great for small spaces", "text": "If you only have 3-4 items to wash, this is amazing. It’s exactly how it’s portrayed online and is so adorable and small. I don’t have hooked to water source. Using buckets to add water, it is a lot of work but no more than hand washing anything.", "images": [], "asin": "B01ALBMIEI", "parent_asin": "B01ALBMIEI", "user_id": "AFTFVXDMIR35N2ZHH7J7HDCQIPFA", "timestamp": 1573306955661, "helpful_vote": 0, "verified_purchase": true}
{"rating": 1.0, "title": "Leaking by third wash", "text": "We live in a5th wheel and wanted to have an option for doing laundry so we decided to go with this one. By the third wash, it was leaking water out of the front and back of machine. I’ve contacted the seller to get a refund and not gotten anywhere. I would look at other options before settling in this one. Seller just send the same response when attempting to contact.", "images": [], "asin": "B01ALBMIEI", "parent_asin": "B01ALBMIEI", "user_id": "AEUGQAL277LO6SFXS475XN5HZICQ", "timestamp": 1620903663859, "helpful_vote": 1, "verified_purchase": true}
{"rating": 5.0, "title": "Funciona y es liviana", "text": "[[VIDEOID:e0f1c38908eaf3f439077df538e4297f]] Doy mi opinión ahora, porque la compre en julio del 2020, me sigue funcionando lavado y secado, es ligera y muy cómoda para apartamento, el ruido es poco y lo fundamental no ocupa espacio. Gracias", "images": [], "asin": "B01ALBMIEI", "parent_asin": "B01ALBMIEI", "user_id": "AHKGY3GO2PSHF2VOVXTRJ3TSVVHA", "timestamp": 1619368048256, "helpful_vote": 1, "verified_purchase": true}
{"rating": 4.0, "title": "We were super pumped to find out something like this even existed", "text": "A $100 washing machine?! We were super pumped to find out something like this even existed! We use it weekly in our church to wash rags and towels from the kitchen instead of &#34;hoping&#34; someone takes them home to wash!", "images": [], "asin": "B01ALBMIEI", "parent_asin": "B01ALBMIEI", "user_id": "AGQLFZBLL2HTPOLTXLYYRYNYQMDQ", "timestamp": 1514256794473, "helpful_vote": 1, "verified_purchase": true}
{"rating": 5.0, "title": "Washer", "text": "Gift", "images": [], "asin": "B01ALBMIEI", "parent_asin": "B01ALBMIEI", "user_id": "AHTZRPB6K3NJ3PAY7ZGI4MPAIY7A", "timestamp": 1602146565143, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Cool", "text": "[[VIDEOID:35a2f887fafa97cb8a8a1075218d16c]] Works well however the drain hose is too little and short and I've bought 2 extensions that were  recommended  on here and none of them work.", "images": [], "asin": "B01ALBMIEI", "parent_asin": "B01ALBMIEI", "user_id": "AERTFJMIARGTX7K7OQ6W72EJC4JA", "timestamp": 1614551416807, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Giantex -  Practical Innovations for people who are not afraid to do a little extra work", "text": "This was a life saver for me.  After our washer stopped working and then our dryer, again, I was just so done.  I decided I needed a backup as going to the laundromat is a huge problem for me time wise.  My schedule is just way too hectic for that.  So after trying hand washing alone and messing up my hands in the process (hello joint pain), I needed another option.  This little gem did just that for me.  No, you cannot wash a lot of stuff in here.  I usually am able to fit in about 3-5 shirts, 2 pants (depending on the type).  I can even fit sheets in there, at least 2-3 twin size and 3-4 pillowcase covers, no blankets obviously.  Nevertheless, it seriously does the job.  My clothes do come out much cleaner and I also noticed that when washing my clothes in this little bit of practical magic that my skin did not itch as opposed to when we use a traditional washer.  Furthermore, the little spinner also does a pretty good job in that when I hang my clothes up to air dry they are done usually within an hour or two.  However, I do not do a lot of loads in one day as I do wring out any excess water before adding to the spinner and that can further take a toll on my hands so I just wash at best 2-3 loads a day with this.  Now I no longer keep a hamper in my bathroom I just put my things in there until I have enough for a load.<br />I have set up a little laundry station in my bathroom.  This little baby does not take up much space.  I place it in the bathtub when using and add water directly from the faucet from the tub by simply tilting it directly underneath.  When the load is done I switch to drain and lift one side, let the hose hang down to drain the water and repeat until the water is out (usually takes me 2 times to completely drain).  I know this sounds more cumbersome but its not a strain for me.  When I'm done using I put it back in its place after its been thoroughly drained.  FYI:  I tend to let it sit in the tub for a little while after basically manually draining to make sure all of the water is out to prevent leaks which have not happened.  It's not really heavy at all at 20lbs when empty and close to 50lb+ when fully loaded.  But, I like it and I no longer have to worry if my machines conk out again.<br />As for the company, the product came in good time with excellent packaging.  Really pleased with this purchase.  I only wish I had been aware that these things existed years before.<br />Thank you for reading and thank you to the company!!!!!", "images": [], "asin": "B01ALBMIEI", "parent_asin": "B01ALBMIEI", "user_id": "AE3M2JR5USDC6V7OKCXLND4ZKKDA", "timestamp": 1469560662000, "helpful_vote": 14, "verified_purchase": true}
{"rating": 5.0, "title": "good for small spaces,high noise level and shakiness upon spinning clothes", "text": "It is good for small spaces and can fit a bathroom of small apartment. Noise level is pretty high as well as shakiness when spinning clothes.", "images": [], "asin": "B01ALBMIEI", "parent_asin": "B01ALBMIEI", "user_id": "AELORPUNWHEJDM6NFEAY5I7OJ7CQ", "timestamp": 1605071838530, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Quality product.", "text": "Great buy.", "images": [], "asin": "B01ALBMIEI", "parent_asin": "B01ALBMIEI", "user_id": "AH7JTSLJTQ4A4Q3UORPEGRBGY7GQ", "timestamp": 1618989598116, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Definitely worth the buy", "text": "We've been using this for over two years and it still works like a champ. We use it multiple times a day, every day. We have a family of six, use coth diapers for our youngest, and our second youngest is a bed wetter, so that means we've got three to four loads of laundry to wash. Every. Single. day. This thing has managed to keep up with all of it. Im thoroughly impressed with how well its held up.", "images": [], "asin": "B01ALBMIEI", "parent_asin": "B01ALBMIEI", "user_id": "AEKSI575UP7LPD4NUWJFI53IFV3Q", "timestamp": 1583348591493, "helpful_vote": 2, "verified_purchase": true}
